vertical-pod-autoscaler/experiments/sn-pbr-throughput/5plus/home.log
Running 15m test @ http://10.101.5.26:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 4.940ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 5.198ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   108.38ms   93.13ms 417.28ms   80.30%
    Req/Sec    30.68     43.68   142.00     92.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   83.97ms
 75.000%  149.38ms
 90.000%  227.46ms
 99.000%  417.28ms
 99.900%  702.46ms
 99.990%    1.18s 
 99.999%    1.27s 
100.000%    1.38s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.723     0.000000            1         1.00
      22.207     0.100000         5321         1.11
      34.463     0.200000        10658         1.25
      48.895     0.300000        15960         1.43
      65.375     0.400000        21281         1.67
      83.967     0.500000        26603         2.00
      94.207     0.550000        29263         2.22
     105.727     0.600000        31933         2.50
     118.271     0.650000        34587         2.86
     132.607     0.700000        37249         3.33
     149.375     0.750000        39910         4.00
     158.847     0.775000        41234         4.44
     169.343     0.800000        42562         5.00
     180.735     0.825000        43887         5.71
     193.535     0.850000        45225         6.67
     209.023     0.875000        46550         8.00
     217.727     0.887500        47213         8.89
     227.455     0.900000        47884        10.00
     237.567     0.912500        48542        11.43
     250.111     0.925000        49212        13.33
     264.959     0.937500        49881        16.00
     272.895     0.943750        50206        17.78
     283.135     0.950000        50539        20.00
     293.887     0.956250        50871        22.86
     306.687     0.962500        51204        26.67
     323.839     0.968750        51537        32.00
     332.031     0.971875        51702        35.56
     342.271     0.975000        51868        40.00
     353.279     0.978125        52034        45.71
     364.543     0.981250        52202        53.33
     378.623     0.984375        52366        64.00
     387.583     0.985938        52450        71.11
     398.079     0.987500        52532        80.00
     409.855     0.989062        52615        91.43
     421.631     0.990625        52699       106.67
     441.343     0.992188        52781       128.00
     450.303     0.992969        52825       142.22
     458.495     0.993750        52866       160.00
     470.527     0.994531        52907       182.86
     485.887     0.995313        52947       213.33
     505.343     0.996094        52989       256.00
     520.447     0.996484        53009       284.44
     534.015     0.996875        53030       320.00
     546.815     0.997266        53051       365.71
     573.951     0.997656        53072       426.67
     598.527     0.998047        53094       512.00
     616.447     0.998242        53103       568.89
     632.319     0.998437        53113       640.00
     650.239     0.998633        53124       731.43
     680.959     0.998828        53134       853.33
     714.751     0.999023        53145      1024.00
     741.887     0.999121        53150      1137.78
     803.839     0.999219        53155      1280.00
     904.703     0.999316        53160      1462.86
     927.231     0.999414        53165      1706.67
     966.143     0.999512        53171      2048.00
     974.847     0.999561        53173      2275.56
    1033.727     0.999609        53176      2560.00
    1042.943     0.999658        53178      2925.71
    1056.767     0.999707        53182      3413.33
    1060.863     0.999756        53184      4096.00
    1072.127     0.999780        53185      4551.11
    1095.679     0.999805        53186      5120.00
    1106.943     0.999829        53187      5851.43
    1160.191     0.999854        53189      6826.67
    1162.239     0.999878        53190      8192.00
    1182.719     0.999890        53191      9102.22
    1182.719     0.999902        53191     10240.00
    1206.271     0.999915        53192     11702.86
    1217.535     0.999927        53193     13653.33
    1217.535     0.999939        53193     16384.00
    1265.663     0.999945        53195     18204.44
    1265.663     0.999951        53195     20480.00
    1265.663     0.999957        53195     23405.71
    1265.663     0.999963        53195     27306.67
    1265.663     0.999969        53195     32768.00
    1265.663     0.999973        53195     36408.89
    1265.663     0.999976        53195     40960.00
    1265.663     0.999979        53195     46811.43
    1376.255     0.999982        53196     54613.33
    1376.255     1.000000        53196          inf
#[Mean    =      108.376, StdDeviation   =       93.135]
#[Max     =     1375.232, Total count    =        53196]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  53850 requests in 15.00m, 459.61MB read
  Socket errors: connect 0, read 0, write 8, timeout 0
Requests/sec:     59.83
Transfer/sec:    522.91KB